In [2]:
!pip install psycopg2

Collecting psycopg2
  Downloading psycopg2-2.9.1-cp38-cp38-win_amd64.whl (1.1 MB)
Installing collected packages: psycopg2
Successfully installed psycopg2-2.9.1

In [4]:
import pandas as pd
import matplotlib.pyplot as plt
from config import username, password
%matplotlib inline

from sqlalchemy import create_engine
engine = create_engine(f'postgresql://{username}:{password}@localhost:5432/employee_db')
connection = engine.connect()

In [7]:
#Import the Employees Table
employees = pd.read_sql('select * from employees', connection, parse_dates=['birth_date', 'hire_date'])
employees.head()

   emp_no emp_title birth_date  first_name  last_name sex  hire_date
0  473302     s0001 1953-07-25    Hideyuki   Zallocco   M 1990-04-28
1  475053     e0002 1954-11-18       Byong  Delgrande   F 1991-09-07
2   57444     e0002 1958-01-30       Berry       Babb   F 1992-03-21
3  421786     s0001 1957-09-28       Xiong   Verhoeff   M 1987-11-26
4  282238     e0003 1952-10-28  Abdelkader    Baumann   F 1991-01-18

In [9]:
#import the departments table
departments = pd.read_sql('select * from departments', connection)
departments.head()

  dept_no        dept_name
0    d001        Marketing
1    d002          Finance
2    d003  Human Resources
3    d004       Production
4    d005      Development

In [10]:
#import salaries table
salaries = pd.read_sql('select * from salaries', connection)
salaries.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228